import numpy as np
import matplotlib.pyplot as plt
import matplotlib.mlab as mlab

# Напишите код, моделирующий выпадение поля в рулетке (с учетом поля ZERO)
for i in range(0, 3):
    a = input()
    x = int(np.random.uniform(0, 36))
    print(x)
    